Revit 2027 API
FabricationPart.LiningType Property
 The lining type of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string LiningType { get; }
Public ReadOnly Property LiningType As String
	Get
public:
property String^ LiningType {
	String^ get ();
}
member LiningType : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace